Revit 2017 API
RebarCoupler.GetCouplerPositionTransform Method
 Return a transform representing the relative position of the coupler at index couplerPositionIndex in the set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public Transform GetCouplerPositionTransform(
	int couplerPositionIndex
)
Visual Basic
Public Function GetCouplerPositionTransform ( _
	couplerPositionIndex As Integer _
) As Transform
Visual C++
public:
Transform^ GetCouplerPositionTransform(
	int couplerPositionIndex
)
Parameters
couplerPositionIndex
Type: System.Int32
 An index between 0 and (CouplerQuantity-1).
Return Value
 The position of a coupler in the set relative (0,0,0).
Remarks
 The transform is a translation along the distribution path and a rotation what will align coupler with the bar segment on which stays
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  couplerPositionIndex is not in the range [ 0, CouplerQuantity-1 ].
See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace